namespace Camp_FourthWeek_Basic_C__;


public interface IUIBase
{
    Tuple<int, int> Pivot { get; }
    string UiString { get; }
}
public interface IUICusor
{
    Tuple<int, int> CusorPivot { get; }
}


public enum UIName
{
    Intro_TextBox,

}

public static class UITable
{
        public static readonly Dictionary<UIName, int[]> UITableDic = new Dictionary<UIName, int[]>
    {
        {
            UIName.Intro_TextBox, new int[] { 1, 2 }
        },
 
        // 필요하면 계속 추가
    };
    
    public static readonly Dictionary<int, UI> UIDic = new Dictionary<int, UI>
    {
               {
            // 인트로 텍스트 박스
            0,
            new UI(
                new Tuple<int, int>(0,0),
                @"
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /
                                                                                                                                                                            /"
            )
        },
        {
            // 인트로 텍스트 박스
            1, 
            new UI(
                new Tuple<int, int>(0, 41),
                @"
  #@@:                                                                                                                                                               :@@@   
 @@  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@+ %@  
 @#.@@                                                                                                                                                               @@= @  
 @= @                                                                                                                                                                 @  @  
 @- @                                                                                                                                                                 @= @  
 @= @                                                                                                                                                                 @= @  
 @= @                                                                                                                                                                 @= @  
 @= @                                                                                                                                                                 @= @  
 @- @                                                                                                                                                                 @= @  
 @= @                                                                                                                                                                 @= @  
 @*-@                                                                                                                                                                 @# @  
 @- @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  @  
 @@@                                                                                                                                                                   @@@  
    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@     "
            )
        },
        {
            // 인트로 오박사
            2,
            new UI(
                new Tuple<int, int>(0, 3),
                @"
                                                                          @@@@@@@@@@@@=                                                                                      /
                                                                        .  @        . :@@@@                                                                                  /
                                                                        @@@    -+         =@=                                                                                /
                                                                          @: @@@@@*:@@@@@- @@                                                                                /
                                                                          @@@     @@     @:@@                                                                                /
                                                                           .@@@@      .@@@@-                                                                                 /
                                                                          @  .@@@@ .@@+@@  @@                                                                                /
                                                                          @=@   #@= -@   @@@@                                                                                /
                                                                            @@          -@@                                                                                  /
                                                                              @  @@@@@ @                                                                                     /
                                                                          @@@@@@@%  :@@@@@@@.                                                                                /
                                                                        #@     @*@@  -@@@ :@@@@                                                                              /
                                                                       :@  @@@@@  :@%.@@@@@@-  %@                                                                            /
                                                                  @%  %@*   -  @@%@@@@ @      .@@+                                                                           /
                                                             :@@@.=@@@   @ @:   @==.-:@@   @@%@  @*                                                                          /
                                                             @ @@@  @@@  @  @- .@:= * @@  @@ @@=  @                                                                          /
                                                               @@ #  *@@@@  -@  @@*@@@@@  @    @   @                                                                         /
                                                              @  :@@@ + @@   @  @@@@@@@@ +.   #@   @                                                                         /
                                                               @@-   -@. %    .@@@@@@@@@@     +@    @+                                                                       /
                                                                @@@ .   -       @@@@@@@@      =@    @@                                                                       /
                                                                 -@@@@@@@      .@@:.+@@@       @   @+                                                                        /
                                                                        @@@@@+ -@ @@@  @  @@@@@@@@@                                                                          /
                                                                        @   @- =@ *    @  @:   @                                                                             /
                                                                        @   @- =@@@ .:.@  @#  =@                                                                             /
                                                                        @   @= =@=@@ :.@  @*  .@                                                                             /
                                                                        @@  @* +@ :@ ..@  @#  @@                                                                             /
                                                                        @@      @ +@ :=@     :@@                                                                             /
                                                                          @@@@@@= *@ : =@@@@@@                                                                               /
                                                                           @.    .@@+.::    @@                                                                               /
                                                                          *@@@*  @= @- @@@ @@                                                                                /
                                                                         -@@  @@@@@ @@@@@@@@@                                                                                /
                                                                        *@@ .=*%@@@  @@    %@@                                                                               /
                                                                          +@@%+=      :#@@#*                                                                                 /"
            )
        }
        // 필요하면 계속 추가
    };
}


public class UI : IUIBase
{
    public Tuple<int, int> Pivot { get; }
    public string UiString { get; }

    public UI(Tuple<int, int> pivot, string uiString)
    {
        Pivot = pivot;
        UiString = uiString;
    }
}

